# tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"
# Mozilla CA certificate store
brew "ca-certificates"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source suite of directory software
brew "openldap"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Postgres C API library
brew "libpq"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# Modern replacement for 'ls'
brew "exa"
# Core application library for C
brew "glib"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# GPU-based terminal emulator
cask "kitty"
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "Snappy", id: 512617038
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
